chat_system_85467702_actor_description=Grok Erherm. Old dwarf. 
chat_system_85467702_snap_end_question=^?^Here it is, my son! Congratulations! You begin your adult life now, and I want to give you a present.
chat_system_85467702_snap_end_answer_0=^?^Well, what is the present? It looks like a cart, but...
chat_system_85467702_snap_4_question=^?^It's the latest model, just recently brought from Mehgard! Increased capacity - the PGP 902A!<br>Wow Dad! This is the best present ever! I couldn't even dream of something like this!
chat_system_85467702_snap_4_answer_0=^?^Incredible!
chat_system_85467702_snap_5_question=^?^Yes, son, it's precisely that cart. By the way, it is specially made to custom order. The frame is made of ferritic steel, and the handles are all covered with sharkskin. I know that you young guys go for that sort of thing!<br>Thank you, human! If it weren't for you, I would have to blow open this damned door with thunder powder. And who knows what could happen to the cart.<br>[reward]
chat_system_85467702_snap_5_answer_0=^?^I was glad to help you. Good luck!
chat_system_85467702_snap_0_question=^?^Hey, human!! Please, if you would be so kind to help us!
chat_system_85467702_snap_0_answer_0=^?^What's happened? 
chat_system_85467702_snap_0_answer_1=^?^Sorry, dwarf, I'm in a hurry!
chat_system_85467702_snap_1_question=^?^You know, my son has finally become a man; he is 40 years old today. Now he even has the right to drink beer. So I've decided to make him a present, to welcome him to adulthood. I decided to hide the present so that he could only get it using his wit.<br>I ordered a special door and an intricate runic lock. And I had hidden the present behind the door. It's just that my son, well, he's a bonehead, and he's failed to put the runes together correctly. And I forgot the right combination of runes that opens the door as well. Please, will you help us?
chat_system_85467702_snap_1_answer_0=^?^Why not help a good ma... good dwarf... like you? Of course, I'll help.
chat_system_85467702_snap_1_answer_1=^?^I don't have time to waste on an intricate lock!
chat_system_85467702_snap_2_question=^?^That's great! Speak to my son. He has all the information we have about the lock. With the help of that, he should be able to open the lock. Maybe you'll manage to do it.<br>Well, thank you.<br>[reward]
chat_system_85467702_snap_2_answer_0=^?^Ok, I'll speak to him.
chat_system_85467702_snap_3_question=^?^Thank you for your help, human. Otherwise my son wouldn't get his present.
chat_system_85467702_snap_3_answer_0=^?^You are welcome.
